var express = require('express');

var app = express();

app.set('view engine', 'ejs');
app.use('/', express.static('public'));
app.use('/teachers', express.static('public'))
    // set the view engine to ejs


// use res.render to load up an ejs view file

// index page
app.get('/', function(req, res) {
    res.render('index', {});
});
app.get('/teachers', function(req, res) {
    res.render('teachers', {
        teachers: [{
                id: '1',
                img: "./imgs/teachers/anu.png",
                name: 'Г.Анхбаяр',
                age: '22',
                achievement: [
                    { data: 'Аймгийн аварга шалгаруулах өсвөрийн шатрын тэмцээний 7 удаагийн босоо аварга. /Говь-Алтай аймаг/' },
                    { data: 'Өсвөрийн шатарчдын улсын аварга шалгаруулах өсвөрийн хамгийн том тэмцээнд 4-р байр' },
                    { data: 'Монголын хүүхдийн ордны нэрэмжит “Цодгор хүү” ӨАШШТ шагналт 2-р байр.' },
                    { data: 'Өсвөрийн улсын аварга шалгаруулах шатрын түргэвчилсэн төрөлд шагналт 3-р байр.' },
                    { data: 'Улсын чанартай Монгол хүн сансарт ниссэний нэрэмжит Ирээдүйн одод ӨАШШТ 2-р байр, 4-р байр' },
                    { data: 'Оюуны эрэлд 1200 хүүхдийн шатрын наадам 2015 он 1-р байр алтан медаль.' },
                    { data: 'Аймгийн аварга шалгаруулах насанд хүрэгчидийн аварга шалгаруулах шатрын тэмцээн  2-р байр' },
                ],
                experience: [
                    { list: 'Стейниц МША-ийн 2021 оны зуны эрчимжүүлсэн 50 хүүхдийн сургалтыг удирдан багшилсан.' },
                ]
            },
            {
                id: '2',
                img: "./imgs/teachers/batnym.png",
                name: 'М.Батням',
                age: '22',
                achievement: [
                    { data: '2019он Монгол улсын cпортын “Дэд мастер”' },
                    { data: '5-н удаагийн ӨААШШТ-ний Аварга, 3-н удаагийн Дэд байр' },
                    { data: 'Насанд хүрэгчдийн ААШШТ-ний Аварга, Дэд байр' },
                    { data: 'ӨУАШШТ-ний шагналт 5,6-р байр' },
                    { data: '2019 он Хүүхдийн спортын Их наадамд 5-р байр' },
                    { data: 'Булган 2011 бүсийн тэмцээний аварга' },
                    { data: '2016 он Төвийн бүсийн аварга Эрдэнэт хот' },
                    { data: '2013он SriLanka улсад зохиогдсон Азийн аваргад 10-р байранд амжилттай оролцсон.' },
                ],
                experience: [
                    { list: 'Стейниц МША-ийг үүсгэн байгуулагдсан цагаас эхлэн анхан шатаас ахисан шатад зааж сургаж туршлагажсан.' },
                    { list: '10-н жилийн сургууль болон цэцэрлэгт гэрээт багшаар ажилласан ба цэцэрлэгийн өмнөх насны хүүхдэд шатрын боловсрол олгох чадвар өндөр.' },
                ]
            },
            {
                id: '3',
                img: "./imgs/teachers/enkhbayr.png",
                name: 'Г.Энхбаяр',
                age: '22',
                achievement: [
                    { data: 'Монгол Улсын Дэд Мастер цол' },
                    { data: '2010 онд Хятадад зохиогдсон өсвөрийн шатарчдын ази тивийн аварга шалгаруулах тэмцээнд амжилттай оролцсон.' },
                ],
                experience: [
                    { list: 'Стейниц МША-ийн Салбар 2-ийг хариуцан нэг жилийн хугацаанд ажилласан.' },
                    { list: 'Академиас бүтээсэн хамгийн шинэлэг, системчлэгдсэн 3 багц, 9 сар, 108 видео хичээл бүхий цахим шатрын сургалтыг хамтран үүсгэн байгуулагч.' },
                    { list: 'Академиас хэрэгжүүлсэн хамгийн анхны системчлэгдсэн анхан шатны 100 хүүхдэд зориулсан 6 сарын шатрын төсөл дээр хамтран ажиллаж амжилттай хэрэгжүүлсэн.' },
                    { list: 'Олонлог ЕБС-д 1 жилийн турш шатрын багшаар ажиллаж байсан.' },
                    { list: '“Баялаг Бөмбөөхэй” цэцэрлэгт шатрын багшаар 1 жилийн турш ажиллаж байсан ба сургуулийн өмнөх боловсролын хүүхдүүдэд заах чадвартай.' },
                    { list: 'Мончесс МБША-аас хэрэгжүүлсэн төслийн хүрээнд “57-р цэцэрлэг”-д 6 сар шатрын багшаар ажиллаж байсан ба сургуулийн өмнөх боловсролын хүүхдүүдэд заах чадвартай.' },
                    { list: '79-р ЕБСургуульд 1 жилд шатрын тусгай хөтөлбөр хэрэгжүүлсэн.' },
                ]
            },
            {
                id: '4',
                img: "./imgs/teachers/boldbaatar.png",
                name: 'Б.Болдбаатар',
                age: '22',
                achievement: [
                    { data: 'FI, Дэлхийн шатрын холбооны зөвлөх дасгалжуулагч цол' },
                    { data: 'Шатрын спортын Монгол улсын шүүгч' },
                    { data: 'Монгол улсын Спортын мастер' },
                    { data: 'Биеийн тамир спортын тэргүүний ажилтан 2010' },
                    { data: 'Ардын боловсролын тэргүүний ажилтан 2013' },
                    { data: 'Алтан гадас одон 2015' },
                ],
                experience: [
                    { list: '36 жил Монголын шатрын хөгжилийг чиглүүлэгч, түүчээлэгч болж ажилласан туршлагатай' },
                    { list: 'Монголын Үйлдвэрчиний Эвлэлийн “Цагаан Бэрс” шатрын клуб тэргүүтэй 30 орчим байгууллагад ажиллаж, хөгжүүлж, удирдаж ирсэн.' },
                    { list: 'Анхан шатнаас ахисан хүртэл системтэй хөгжих шатрын тактик сэтгэлгээ хөгжүүлэх цуврал 30 номны зохиогч. Уг номыг академид дасгал ажлын ном болгон аишгладаг.' },
                    { list: 'Стейниц МША-ийн багт элсээд, зөвлөх багшаар 1 жил ажиллаж буй.' },
                ]
            },
            {
                id: '5',
                img: "./imgs/teachers/anu.png",
                name: 'Б.Ану',
                age: '22',
                achievement: [
                    { data: 'ОУХМ Шатрын спортын төрлөөр МУ-ын Олон улсын хэмжээний мастер цол (2010 он)' },
                    { data: 'WFM Дэлхийн шатрын холбооны мастер цол (2011 он)' },
                    { data: 'FI Дэлхийн шатрын холбооны зөвлөх дасгалжуулагч цол (2016 он)' },
                    { data: 'FA Дэлхийн шатрын холбооны шүүгчийн 2 балл (2016, 2017 он)' },
                    { data: 'WIM Дэлхийн шатрын холбооны Олон улсын мастерын 2 балл (2018, 2019 он)' },
                    { data: 'WGM Дэлхийн шатрын холбооны Их мастерын 1 балл (2018 он)' },
                    { data: 'Сонирхогчдын дэлхийн аварга шалгаруулах тэмцээний алт, мөнгөн медаль (2010, 2011 он)' },
                    { data: 'Сурагчдын дэлхийн аварга шалгаруулах тэмцээний мөнгөн медаль (2008 он)' },
                    { data: 'Азийн оюутны аварга шалгаруулах тэмцээний хүрэл медаль (2015 он)' },
                    { data: 'Азийн хүүхдийн спортын IV их наадмын IV байр (2008 он)' },
                    { data: 'Сюзан Полгарын нэрэмжит дэлхийн нээлттэй тэмцээний I байр (2010 он)' },
                    { data: 'Бүх Америкийн охидын аварга шалгаруулах “Гран-При” тэмцээний I байр (2010 он)' },
                    { data: 'Олон улсын оюутны “Гран-При” тэмцээний IV байр (2016 он)' },
                    { data: 'Насанд хүрэгчдийн түргэн тоглолтын улсын аварга шалгаруулах тэмцээний хүрэл медаль (2007 он)' },
                    { data: 'Насанд хүрэгчдийн улсын аварга шалгаруулах тэмцээнд 9 удаа шалгарч оролцсон' },
                    { data: 'Оюутны улсын аварга шалгаруулах тэмцээний 1 алт, 2 мөнгө, 1 хүрэл медаль (2012, 2016, 2019 он)' },
                    { data: 'Монголын хүүхдийн спортын II, III их наадмын алт, мөнгөн медаль (2003, 2007 он)' },
                    { data: 'Өсвөрийн улсын аварга шалгаруулах тэмцээний 3 алт, 2 мөнгө, 2 хүрэл медаль (2005-2011 он)' },
                ],
                experience: [
                    { list: '2016 оноос Дэлхийн шатрын холбооны зөвлөх дасгалжуулагч' },
                    { list: '2017 оноос АНУ дахь ерөнхий боловсролын сурагчдад шатрын багш, дасгалжуулагч' },
                    { list: '2017.03 - 2017.06 Гадаад харилцааны яамны Америк, Ойрхи Дорнод, Африкийн газарт Магистрын мэргэжлийн дадлага' },
                    { list: '2019.11 – 2021.01 Монголын шатрын холбооны Гадаад харилцаа хариуцсан мэргэжилтэн 2019 оноос Монголын шатрын холбооны Удирдах зөвлөлийн гишүүн' },
                    { list: '2019 оноос Монголын шатрын холбооны Шүүгчдийн зөвлөлийн дарга' },
                    { list: '2019.11 - 2021.01 Монголын шатрын холбооны албан ёсны хуудасны хөтлөгч' },
                    { list: '2021 оноос “Pro Queens Gambit” АНУ-ын цахим шатрын сургалтын төвийн ахлах дасгалжуулагч' },
                    { list: '2021 оноос “Стейниц Монголын Шатрын Академи”-д' },
                ]
            },
        ],
    })
});

// about page


app.listen(8080);
console.log('Server is listening on port 8080');